#include <stdio.h>

int main2846() {
	int i, n, m, k, c, found;

	// 读取n，直到-1
	while (scanf("%d", &n) == 1 && n != -1) {
		m = (1 << n) - 1; // n是01串的长度，m表示n个01串能够表示的最大值，n=4时，0000~1111, m=2^4-1=15
		c = 0; // c用来表示n个2进制串中，不含101的串个数；也就是在0~m中，不含101的数个数
		while (m >= 0) {
			k = m; 
			found = 0;
			while (k > 0) { 
				// k初值为m，逐步右移1位，然后判断最后三位二进制是否是5
				// 这里先 &7, 7的2进制是0111，确保只取k的后三位，忽略前面的位。
				// 5 ^ 5 = 0, 其他值 ^ 5都不等于0
				if ((k & 7 ^ 5) == 0)
					found++;
				k = k >> 1;
			}
			if (found == 0) // found==0,表示k不含101
				c++;

			m--;
		}

		printf("%d\n", c);
	}

	return 0;
}